In [23]:
import pickle
import pandas as pd
import numpy as np

student= {
    'Rollno':[1,2,3,4,5],
    'name': ['Rohit','Sita','Ravi','Tulasi','Mukhi'],
    'gender':['male','female','male','male','female'],
    'Age':[12,11,13,11,12]
}
df=pd.DataFrame(student)
df

   Rollno    name  gender  Age
0       1   Rohit    male   12
1       2    Sita  female   11
2       3    Ravi    male   13
3       4  Tulasi    male   11
4       5   Mukhi  female   12

In [20]:
import pickle
with open('data.pkl','wb') as f:
 pickle.dump(df,f)

In [21]:
picklein=open("data.pkl",'rb')
predictmodel=pickle.load(picklein)

In [22]:
df.head()

   Rollno    name  gender  Age
0       1   Rohit    male   12
1       2    Sita  female   11
2       3    Ravi    male   13
3       4  Tulasi    male   11
4       5   Mukhi  female   12